In [1]:
import pandas as pd
import numpy as np

In [43]:
#声明一个函数
def f(x):
    return x-1
#创建数据
data = np.random.randint(1,10,(4,4))
df1 = pd.DataFrame(data,columns = ['a','b','c','d'])
df1

   a  b  c  d
0  5  7  6  4
1  8  3  3  7
2  2  5  1  6
3  7  3  8  9

In [44]:
#对列进行操作
print(df1.loc[:,['a','b']].apply(f))

   a  b
0  4  6
1  7  2
2  1  4
3  6  2

In [24]:
#对行元素进行操作
print(df1.loc[0:2].apply(f))

   a  b  c  d
0  4  1  7  7
1  8  7  1  4
2  5  6  3  5

In [176]:
#求和
def f2(x):
    return x.max()

print(df1[['a','b','c','d']].apply(lambda x :x.max()))
print(df1.loc[:,['a','b']].apply(f2))
print(df1.loc[:].apply(f2,axis = 1))  #axis = 1 行操作

a    8
b    7
c    8
d    9
dtype: int64
a    8
b    7
dtype: int64
0    7
1    8
2    6
3    9
dtype: int64

In [33]:
#求平均
def f3(x):
    return x.mean()
print(df1.loc[:,:].apply(f3))
print(df1.loc[:].apply(f3,axis = 1))

a    5.50
b    6.00
c    4.50
d    5.25
dtype: float64
0    5.75
1    6.00
2    5.75
3    3.75
dtype: float64

In [35]:
#创建数据
data = np.random.randint(1,10,(4,4))
df1 = pd.DataFrame(data,columns = ['a','b','c','d'])
df1

   a  b  c  d
0  5  6  3  3
1  1  5  9  4
2  1  8  4  5
3  2  9  6  3

In [42]:
def f4(x,str):
    print(x,str)  #第一个参数代表传入的每一个元素，的二个参数表示传入的参数
    
df1['a'].apply(f4,args = ('haha',))  #通过args传入参数元组

5 haha
1 haha
1 haha
2 haha

0    None
1    None
2    None
3    None
Name: a, dtype: object

# groupy

In [181]:
data = pd.DataFrame({
    'key1':list('aabba'),  
    'key2': ['one','two','one','two','one'],  
    'key3':list('abcde'),
    'data1': np.random.randn(5), 
#     'data1':['1','2','3','4','5'],
    'data2': np.random.randn(5),
    'data3': np.random.randn(5)
})  

data

      data1     data2     data3 key1 key2 key3
0 -0.695517  2.117033  0.199164    a  one    a
1 -0.860843 -0.232305  0.938575    a  two    b
2 -0.089972 -0.063753  0.273264    b  one    c
3  0.660026  1.600198  0.850315    b  two    d
4 -0.123841  0.884652 -1.447643    a  one    e

In [184]:
print(data.groupby(['key3']).apply(lambda x : x.max()))
print(list(data.groupby(['key1'])))
data.groupby(['key3']).apply(lambda x : x.max())

         data1     data2     data3 key1 key2 key3
key3
a    -0.695517  2.117033  0.199164    a  one    a
b    -0.860843 -0.232305  0.938575    a  two    b
c    -0.089972 -0.063753  0.273264    b  one    c
d     0.660026  1.600198  0.850315    b  two    d
e    -0.123841  0.884652 -1.447643    a  one    e
[('a',       data1     data2     data3 key1 key2 key3
0 -0.695517  2.117033  0.199164    a  one    a
1 -0.860843 -0.232305  0.938575    a  two    b
4 -0.123841  0.884652 -1.447643    a  one    e), ('b',       data1     data2     data3 key1 key2 key3
2 -0.089972 -0.063753  0.273264    b  one    c
3  0.660026  1.600198  0.850315    b  two    d)]

         data1     data2     data3 key1 key2 key3
key3
a    -0.695517  2.117033  0.199164    a  one    a
b    -0.860843 -0.232305  0.938575    a  two    b
c    -0.089972 -0.063753  0.273264    b  one    c
d     0.660026  1.600198  0.850315    b  two    d
e    -0.123841  0.884652 -1.447643    a  one    e

In [130]:
#遍历分组
for name,grou in data.groupby(['key1']):
    print(name)
    print(grou)

a
      data1     data2     data3 key1 key2
0 -1.848392 -1.460150 -1.149311    a  one
1  0.023537  0.478313  0.292577    a  two
4 -0.240423  0.433504  0.446909    a  one
b
      data1     data2     data3 key1 key2
2 -0.718688  2.091703  1.715757    b  one
3 -0.447861 -0.124085  0.419056    b  two

In [131]:
grou = data.groupby(['key1'])
grou 
print(grou.mean())  #通过使用聚合函数查看情况
print(grou.sum())
print(grou['data1'].max())

         data1     data2     data3
key1
a    -0.688426 -0.182778 -0.136608
b    -0.583274  0.983809  1.067406
         data1     data2     data3
key1
a    -2.065278 -0.548333 -0.409825
b    -1.166548  1.967618  2.134813
key1
a    0.023537
b   -0.447861
Name: data1, dtype: float64

In [132]:
grou = data.groupby(['key1','key2']).mean()
# grou['data1'].unstack()
grou['data1']

key1  key2
a     one    -1.044407
      two     0.023537
b     one    -0.718688
      two    -0.447861
Name: data1, dtype: float64

In [137]:
data.groupby(['key1','key2'])['data1','data3'].mean()

              data1     data3
key1 key2
a    one  -1.044407 -0.351201
     two   0.023537  0.292577
b    one  -0.718688  1.715757
     two  -0.447861  0.419056

In [125]:
data['data1'].groupby([data['key1'],data['key2']]).mean()

key1  key2
a     one    -0.819154
      two    -0.138453
b     one     0.361438
      two    -1.912654
Name: data1, dtype: float64

练习

In [102]:
#请结合apply与groupy函数完成一下练习
#根据地区进行分组   查看平均年龄和工资
#根据年龄进行分组   查看平均工资
#根据性别进行分组   查看平均工资
#先根据地区，然后在根据性别进行分组，查看各地区不同性别的平均工资
df6 = pd.DataFrame({
    'name':['joe', 'susan', 'anne', 'black', 'monika','ronaldo','leonarldo','tom','yilianna','bulanni'],
    'age':[19,19,18,20,20,18,19,20,18,19],
    'sex':['man','women','women','man','women','man','man','man','women','women'],
    'address':['上海','北京','上海','北京','北京','上海','北京','上海','北京','上海'],
    'money':[8000,8500,7000,9000,10000,7500,8800,9300,12000,11000]
})
df6

  address  age  money       name    sex
0      上海   19   8000        joe    man
1      北京   19   8500      susan  women
2      上海   18   7000       anne  women
3      北京   20   9000      black    man
4      北京   20  10000     monika  women
5      上海   18   7500    ronaldo    man
6      北京   19   8800  leonarldo    man
7      上海   20   9300        tom    man
8      北京   18  12000   yilianna  women
9      上海   19  11000    bulanni  women

In [111]:
def f1(x):
    return x.mean()

def f2(x):
    return x['money'].mean()
#根据地区进行分组   查看平均年龄和工资
print(df6.groupby(['address']).apply(f1))
print('-'*20)
#根据年龄进行分组   查看平均工资
print(df6.groupby(['age'])['money'].apply(f1))
print('-'*20)
#根据性别进行分组   查看平均工资
print(df6.groupby(['sex']).apply(f2))
print('-'*20)
#先根据地区，然后在根据性别进行分组，查看各地区不同性别的平均工资
print(df6.groupby(['address','sex']).apply(f2))

          age   money
address
上海       18.8  8560.0
北京       19.2  9660.0
--------------------
age
18    8833.333333
19    9075.000000
20    9433.333333
Name: money, dtype: float64
--------------------
sex
man      8520.0
women    9700.0
dtype: float64
--------------------
address  sex
上海       man       8266.666667
         women     9000.000000
北京       man       8900.000000
         women    10166.666667
dtype: float64

In [118]:
def f3(x):
    return x['age'].corr(x['money'])
print(df6.groupby(['address'])['age','money'].apply(f3))

address
上海    0.623489
北京   -0.558134
dtype: float64

In [146]:
df = pd.DataFrame({'性别' : ['男', '女', '男', '女',
                              '男', '女', '男', '男'],
                       '成绩' : ['优秀', '优秀', '及格', '差',
                              '及格', '及格', '优秀', '差'],
                       '年龄' : [15,14,15,12,13,14,15,16]})
GroupBy=df.groupby("性别")

In [147]:
#根据性别进行成绩排序
for name ,goru in GroupBy:
    print(name)
    print(goru.sort_values(by = '成绩'))

女
   年龄 性别  成绩
1  14  女  优秀
5  14  女  及格
3  12  女   差
男
   年龄 性别  成绩
0  15  男  优秀
6  15  男  优秀
2  15  男  及格
4  13  男  及格
7  16  男   差

In [167]:
#计算男女比例
total_cnt = df["成绩"].count()
total_cnt
men=df.groupby("性别")['成绩'].count()
nv = (men.loc['女']/total_cnt)*100
nan = (men.loc['男']/total_cnt)*100
print('男生的比例为：',str(nan)+'%')
print('女生的比例为：',str(nv)+'%')
#成绩比例

男生的比例为： 62.5%
女生的比例为： 37.5%